Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
/******************************************************************************
* File Name:   dev_bgt60trxx.c
*
* Description: This file implements the interface with the radar sensor.
*
* Related Document: See README.md
*
*******************************************************************************
* Copyright 2025, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#ifdef IM_ENABLE_BGT60TRXX

#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <cybsp.h>
#include <cy_pdl.h>
#include "xensiv_bgt60trxx_mtb.h"
#include "protocol/protocol.h"
#include "protocol/pb_encode.h"
#include "clock.h"
#include "dev_bgt60trxx_settings.h"
#include "dev_bgt60trxx.h"
#include "xensiv_bgt60trxx_platform.h"

/*******************************************************************************
* Macros
*******************************************************************************/

#define DEV_BGT60TRXX_OPTION_PRESET     (1)
#define DEV_BGT60TRXX_OPTION_CUSTOM_SET (2)

#define XENSIV_BGT60TRXX_SPI_BURST_MODE_CMD             (0xFF000000UL)  /* Write addr 7f<<1 | 0x01; */
#define XENSIV_BGT60TRXX_SPI_BURST_MODE_SADR_POS        (17U)
#define XENSIV_BGT60TRXX_SPI_BURST_MODE_RWB_POS         (16U)
#define XENSIV_BGT60TRXX_SPI_BURST_MODE_LEN_POS         (9U)

#define DMA_CHANNEL_SPI_TX 14
#define DMA_CHANNEL_SPI_RX 15
#define SPI_FIFO_USE 32
/*******************************************************************************
* Preset configuration variables and structs.
*******************************************************************************/
/* This value could be modified later to increase response time if the data
* rate from the radar is low. Note that the minimum size is the size of one frame.
*/

#define DEFAULT_FIFO_SETTING 12288 // This is in number of samples.
struct radar_config radar_configs[5];
int current_config_g = 0;

/*******************************************************************************
* Types
*******************************************************************************/

typedef struct {
    xensiv_bgt60trxx_mtb_t bgt60_obj;
    int skipped_frames;
} dev_bgt60trxx_t;

struct xensiv_bgt60trxx_type
{
    uint32_t fifo_addr;
    uint16_t fifo_size;
    xensiv_bgt60trxx_device_t device;
};

/*******************************************************************************
 * Global Variables
 ******************************************************************************/
int radar_sent_frames=0;
extern cy_stc_scb_spi_context_t SPI_context;

CY_SECTION(".cy_socmem_data") uint16_t bgt60_send_buffer[16384]={0}; // Max number of samples that fit in the radar fifo.

/******************************************************************************
 * DMA-Descriptors for the radar-dma
 *****************************************************************************/
CY_SECTION(".cy_socmem_data") CY_ALIGN(32) cy_stc_dma_descriptor_t dma_desc_tx[16]={0};
CY_SECTION(".cy_socmem_data") CY_ALIGN(32) cy_stc_dma_descriptor_t dma_desc_rx[16]={0};

/* This is used for the tx data source when feeding the clock output.
** Some notes: The SPI wire require transport of outgoing data to
** get some data back. Data will be in a shiftregister that is driven
** by a clock. Some dummy data will thus be shifted in. The value
** of the data is "Dont Care" in this case.
*/
CY_SECTION(".cy_socmem_data") uint16_t dummy_tx_buffer = 0x1122;

/* The SCB used for SPI is SCB3.*/
volatile uint32_t* PERI_SCB3_TX_FIFO_WR         = (uint32_t*)0x429B0240;
volatile uint32_t* PERI_SCB3_RX_FIFO_RD         = (uint32_t*)0x429B0340;

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
static bool _config_hw(dev_bgt60trxx_t *radar, int preset);
static bool _init_hw(dev_bgt60trxx_t *radar);
static bool _configure_streams(protocol_t* protocol, int device, void* arg);
static void _start_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg);
static void _stop_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg);
static void _poll_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg);

static void _load_presets();
static void _load_custom_values( uint8_t* data_blob );

static bool _write_payload(
    protocol_t* protocol,
    int device_id,
    int stream_id,
    int frame_count,
    int total_bytes,
    pb_ostream_t* ostream,
    void* arg);

