Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
/*******************************************************************************
* Function Name: _configure_dma_tx_descriptors
********************************************************************************
* Summary:
*    configuring the dma tx descriptors
*
* Parameters:
*   dma_desc[]   DMA descriptor structure
* Return:
*   None.
*
*******************************************************************************/
static void _configure_dma_tx_descriptors( cy_stc_dma_descriptor_t dma_desc[] ){

    int frames = radar_configs[current_config_g].fifo_int_level   /   radar_configs[current_config_g].num_samples_per_frame;
    int actual_samples = frames * radar_configs[current_config_g].num_samples_per_frame;

    /* We like to unload the number of frames from the radar.
    ** The total amount of samples is calculated upon this value.
    ** Here we only care about the number of samples we need to read out
    ** from the radar. The spi-fifo is ideally set to 32 samples per burst.
    */
    int descriptor = 0;
    int samples_to_do = actual_samples;
    while ( samples_to_do )
    {

        /* Common stuff for each new descriptor.
         * In general a review of any POSSIBLE uninitialized fields should be done!
         */
        Cy_DMA_Descriptor_SetRetrigger(&dma_desc[descriptor], CY_DMA_WAIT_FOR_REACT);

        /* Perhaps a 2D transfer is better. 384*32 words.*/
        Cy_DMA_Descriptor_SetDescriptorType(&dma_desc[descriptor], CY_DMA_2D_TRANSFER);

        /*Each trigger should only run an X-loop */
        Cy_DMA_Descriptor_SetTriggerInType(&dma_desc[descriptor], CY_DMA_X_LOOP);

        Cy_DMA_Descriptor_SetDataSize(&dma_desc[descriptor], CY_DMA_HALFWORD);
        Cy_DMA_Descriptor_SetSrcTransferSize(&dma_desc[descriptor], CY_DMA_TRANSFER_SIZE_DATA);
        Cy_DMA_Descriptor_SetDstTransferSize(&dma_desc[descriptor], CY_DMA_TRANSFER_SIZE_WORD ); /* Bus is 32 bit  wide! */

        Cy_DMA_Descriptor_SetXloopSrcIncrement(&dma_desc[descriptor], 0);
        Cy_DMA_Descriptor_SetXloopDstIncrement(&dma_desc[descriptor], 0);

        Cy_DMA_Descriptor_SetYloopSrcIncrement(&dma_desc[descriptor], 0);
        Cy_DMA_Descriptor_SetYloopDstIncrement(&dma_desc[descriptor], 0);

        Cy_DMA_Descriptor_SetInterruptType(&dma_desc[descriptor], CY_DMA_DESCR_CHAIN );

        Cy_DMA_Descriptor_SetSrcAddress(&dma_desc[descriptor], &dummy_tx_buffer );
        Cy_DMA_Descriptor_SetDstAddress(&dma_desc[descriptor], (void*)PERI_SCB3_TX_FIFO_WR);

        if ( samples_to_do < SPI_FIFO_USE ){
            /* Create a special handling for this. */

            /* Code in this case is not tested. Redundant code due to keep the similarity
            ** with main part below in the else{} case. */
            int y_count = 1;
            Cy_DMA_Descriptor_SetXloopDataCount(&dma_desc[descriptor], samples_to_do);
            Cy_DMA_Descriptor_SetYloopDataCount(&dma_desc[descriptor], y_count);
            samples_to_do -= samples_to_do*y_count;
        }
        else
        {
            /* We can have max 256 y-loop counter.*/
            int y_count = samples_to_do/SPI_FIFO_USE;
            if ( y_count > 256 ) y_count=256;

            Cy_DMA_Descriptor_SetXloopDataCount(&dma_desc[descriptor], SPI_FIFO_USE);
            Cy_DMA_Descriptor_SetYloopDataCount(&dma_desc[descriptor], y_count);
            samples_to_do -= SPI_FIFO_USE*y_count;
        }

        if ( samples_to_do ){
            Cy_DMA_Descriptor_SetNextDescriptor(&dma_desc[descriptor], &dma_desc[descriptor+1] );
            /* Increment to the next descriptor.*/
            descriptor++;
        }
        else
        {
            /* Finalize with this descriptor by setting round robin.*/
            Cy_DMA_Descriptor_SetNextDescriptor(&dma_desc[descriptor], &dma_desc[0] );
            /* Disable any  more transfers. This is needed for the sending at least. */
            Cy_DMA_Descriptor_SetChannelState(&dma_desc[descriptor], CY_DMA_CHANNEL_DISABLED );
        }
        
        /*make dummy_tx_buffer cacheable. Need to clean tx desc D-cache*/
        SCB_CleanDCache_by_Addr((uint32_t*)&dma_desc[descriptor], sizeof(dma_desc[descriptor]));
              
    }

}

/*******************************************************************************
* Function Name: _configure_dma_rx_descriptors
********************************************************************************
* Summary:
*    This is our destination buffer. Use the same concept as above for the sizes.
*
* Parameters:
*   dest_address address of bgt60_send_buffer
*   dma_desc[]   DMA descriptor structure
* Return:
*   None.
*
*******************************************************************************/

static void _configure_dma_rx_descriptors( void* dest_address, cy_stc_dma_descriptor_t dma_desc[] )
{

    int frames = radar_configs[current_config_g].fifo_int_level / radar_configs[current_config_g].num_samples_per_frame;
    int actual_samples = frames * radar_configs[current_config_g].num_samples_per_frame;

    int addr_offset = 0;

    /* We like to unload the number of frames from the radar.
    * The total amount of samples is calculated upon this value.
    * Here we only care about the number of samples we need to read out
    * from the radar. The spi-fifo is ideally set to 32 samples per burst.
    */
    int descriptor = 0;
    int samples_to_do = actual_samples;
    while ( samples_to_do )
    {

        /* Common stuff for each new descriptor.*/
        /* In general a review of any POSSIBLE uninitialized fields should be done!*/
        Cy_DMA_Descriptor_SetRetrigger(&dma_desc[descriptor], CY_DMA_WAIT_FOR_REACT);

        /* Perhaps a 2D transfer is better. 384*32 words.*/
        Cy_DMA_Descriptor_SetDescriptorType(&dma_desc[descriptor], CY_DMA_2D_TRANSFER);

        /*Each trigger should only run an X-loop*/
        Cy_DMA_Descriptor_SetTriggerInType(&dma_desc[descriptor], CY_DMA_X_LOOP);

        Cy_DMA_Descriptor_SetDataSize(&dma_desc[descriptor], CY_DMA_HALFWORD);
        Cy_DMA_Descriptor_SetSrcTransferSize(&dma_desc[descriptor], CY_DMA_TRANSFER_SIZE_WORD);
        Cy_DMA_Descriptor_SetDstTransferSize(&dma_desc[descriptor], CY_DMA_TRANSFER_SIZE_DATA );

