Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
        Cy_DMA_Descriptor_SetXloopSrcIncrement(&dma_desc[descriptor], 0);
        Cy_DMA_Descriptor_SetXloopDstIncrement(&dma_desc[descriptor], 1); // One 16-bit word

        Cy_DMA_Descriptor_SetYloopSrcIncrement(&dma_desc[descriptor], 0);
        Cy_DMA_Descriptor_SetYloopDstIncrement(&dma_desc[descriptor], SPI_FIFO_USE);

        Cy_DMA_Descriptor_SetInterruptType(&dma_desc[descriptor], CY_DMA_DESCR_CHAIN );

        Cy_DMA_Descriptor_SetSrcAddress(&dma_desc[descriptor], (void*)PERI_SCB3_RX_FIFO_RD);
        Cy_DMA_Descriptor_SetDstAddress(&dma_desc[descriptor], (void*)((int)dest_address + addr_offset));

        if ( samples_to_do < SPI_FIFO_USE )
        {
            /* Create a special handling for this.*/
            /* Code in this case is not tested. Redundant code due to keep the similarity
            ** with main part. */
            int y_count = 1;
            Cy_DMA_Descriptor_SetXloopDataCount(&dma_desc[descriptor], samples_to_do);
            Cy_DMA_Descriptor_SetYloopDataCount(&dma_desc[descriptor], y_count);
            addr_offset += samples_to_do*2*y_count;
            samples_to_do -= samples_to_do*y_count;
        }
        else
        {
            /* We can have max 256 y-loop counter.*/
            int y_count = samples_to_do/SPI_FIFO_USE;
            if ( y_count > 256 ) y_count=256;

            Cy_DMA_Descriptor_SetXloopDataCount(&dma_desc[descriptor], SPI_FIFO_USE);
            Cy_DMA_Descriptor_SetYloopDataCount(&dma_desc[descriptor], y_count);
            addr_offset += SPI_FIFO_USE*2*y_count;
            samples_to_do -= SPI_FIFO_USE*y_count;
        }

        if ( samples_to_do )
        {
            Cy_DMA_Descriptor_SetNextDescriptor(&dma_desc[descriptor], &dma_desc[descriptor+1] );
            /* Increment to the next descriptor.*/
            descriptor++;
        }
        else
        {
            /* Finalize with this descriptor by setting round robin.*/
            Cy_DMA_Descriptor_SetNextDescriptor(&dma_desc[descriptor], &dma_desc[0] );
            /* Disable any furter transfers.*/
            Cy_DMA_Descriptor_SetChannelState(&dma_desc[descriptor], CY_DMA_CHANNEL_DISABLED );
        }
        
        /* dest_address cacheable. Need to clean rx - desc d-cache*/
        SCB_CleanDCache_by_Addr((uint32_t*)&dma_desc[descriptor], sizeof(dma_desc[descriptor]));

    }
}

/*******************************************************************************
* Function Name: enable_dma_triggers
********************************************************************************
* Summary:
*    A function used to enable the dma
*
* Parameters:
*   dest_address address of bgt60_send_buffer
*
* Return:
*   None.
*
*******************************************************************************/
void enable_dma_triggers( void* dest_address )
{

    _configure_dma_tx_descriptors( dma_desc_tx );
    _configure_dma_rx_descriptors( dest_address, dma_desc_rx );

    Cy_DMA_Channel_SetDescriptor(DW0, DMA_CHANNEL_SPI_TX, &dma_desc_tx[0]);
    Cy_DMA_Channel_SetPriority(DW0, DMA_CHANNEL_SPI_TX, 0);

    Cy_DMA_Channel_SetDescriptor(DW0, DMA_CHANNEL_SPI_RX, &dma_desc_rx[0]);
    Cy_DMA_Channel_SetPriority(DW0, DMA_CHANNEL_SPI_RX, 0);

    Cy_DMA_Enable(DW0);

    /* Enable the triggering of DMA transfers trough the trigger matrix.
    * Note that there is a PERI_TR_CMD register that can be used to
    * do a manual triggering if desired for testing or other purposes.
    */
    Cy_TrigMux_Select( PERI_0_TRIG_OUT_1TO1_0_SCB3_TX_TO_PDMA0_TR_IN14, false, TRIGGER_TYPE_LEVEL );
    Cy_TrigMux_Select( PERI_0_TRIG_OUT_1TO1_0_SCB3_RX_TO_PDMA0_TR_IN15, false, TRIGGER_TYPE_LEVEL );

}

/*******************************************************************************
* Function Name: _init_hw
********************************************************************************
* Summary:
*    A function used to initialize the Radar sensor
*
* Parameters:
*   None
*
* Return:
*     The status of the initialization.
*
*******************************************************************************/
static bool _init_hw(dev_bgt60trxx_t *radar)
{
    cy_rslt_t result;
    radar->skipped_frames = 0;

   /* Enable the RADAR. */
    radar->bgt60_obj.iface.scb_inst = CYBSP_SPI_CONTROLLER_HW;
    radar->bgt60_obj.iface.spi = &SPI_context;
    radar->bgt60_obj.iface.sel_port = CYBSP_RSPI_CS_PORT;
    radar->bgt60_obj.iface.sel_pin = CYBSP_RSPI_CS_PIN;
    radar->bgt60_obj.iface.rst_port = CYBSP_RADAR_RESET_PORT;
    radar->bgt60_obj.iface.rst_pin = CYBSP_RADAR_RESET_PIN;
    radar->bgt60_obj.iface.irq_port = CYBSP_RADAR_INT_PORT;
    radar->bgt60_obj.iface.irq_pin = CYBSP_RADAR_INT_PIN;
    radar->bgt60_obj.iface.irq_num = CYBSP_RADAR_INT_IRQ;

    /* Reduce drive strength to improve EMI */
    Cy_GPIO_SetSlewRate(CYBSP_RSPI_MOSI_PORT, CYBSP_RSPI_MOSI_PIN, CY_GPIO_SLEW_FAST);
    Cy_GPIO_SetDriveSel(CYBSP_RSPI_MOSI_PORT, CYBSP_RSPI_MOSI_PIN, CY_GPIO_DRIVE_1_8);
    Cy_GPIO_SetSlewRate(CYBSP_RSPI_CLK_PORT, CYBSP_RSPI_CLK_PIN, CY_GPIO_SLEW_FAST);
    Cy_GPIO_SetDriveSel(CYBSP_RSPI_CLK_PORT, CYBSP_RSPI_CLK_PIN, CY_GPIO_DRIVE_1_8);

    result = xensiv_bgt60trxx_mtb_init(&radar->bgt60_obj, radar_configs[0].register_list, radar_configs[0].number_of_regs);
    if (CY_RSLT_SUCCESS == result)
    {
        xensiv_bgt60trxx_mtb_interrupt_init(&radar->bgt60_obj, radar_configs[0].fifo_int_level);
    }
    else
    {
        printf("ERROR: xensiv_bgt60trxx_mtb_init failed\n");
        return false;
    }

    Cy_SysLib_Delay(1000);

    /* Enable the radar triggers*/
    enable_dma_triggers( &bgt60_send_buffer );

    return true;
}



/*******************************************************************************
 * Platform functions implementation
 ********************************************************************************/
__STATIC_INLINE void spi_set_data_width(CySCB_Type* base, uint32_t data_width)
{
    CY_ASSERT(CY_SCB_SPI_IS_DATA_WIDTH_VALID(data_width));

    CY_REG32_CLR_SET(SCB_TX_CTRL(base),
                     SCB_TX_CTRL_DATA_WIDTH,
                     (uint32_t)data_width - 1U);
    CY_REG32_CLR_SET(SCB_RX_CTRL(base),
                     SCB_RX_CTRL_DATA_WIDTH,
                     (uint32_t)data_width - 1U);
}

