Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
/*******************************************************************************
* Function Name: _configure_streams
********************************************************************************
* Summary:
*   Called when the device is configured or re-configured.
*
* Parameters:
*   protocol: Pointer the protocol handle
*   device: The device index
*   arg: Pointer the device struct (dev_bgt60trxx_t)
*
* Return:
*   True to keep the connection open, otherwise false.
*
*******************************************************************************/
static bool _configure_streams(protocol_t* protocol, int device, void* arg)
{
    UNUSED(arg);
    int preset_index=0;

    if(protocol_clear_streams(protocol, device) != PROTOCOL_STATUS_SUCCESS)
    {
        protocol_set_device_status(
                protocol,
                device,
                protocol_DeviceStatus_DEVICE_STATUS_ERROR,
                "Failed to clear streams.");
        return true;
    }

    /* Check if custom option exist. */
    int status;
    pb_bytes_array_t* pb_bytes;

    status = protocol_get_option_blob(protocol, device,
                DEV_BGT60TRXX_OPTION_CUSTOM_SET,
                &pb_bytes);

    if (PROTOCOL_STATUS_SUCCESS != status)
    {
        printf("Getting blob option failed\n");
    }

    if ( pb_bytes == NULL )
    {
        /*printf("Don't have any blob option.\n"); */
    }
    else
    {
        _load_custom_values( (uint8_t*)pb_bytes);
    }

    protocol_get_option_oneof(protocol, device, DEV_BGT60TRXX_OPTION_PRESET, &preset_index);
    current_config_g = preset_index;

    int stream = protocol_add_stream(
        protocol,
        device,
        "Radar",
        protocol_StreamDirection_STREAM_DIRECTION_OUTPUT,
        protocol_DataType_DATA_TYPE_S16,
        radar_configs[preset_index].frame_rate, /* Frequency in number of frames per second. */
                                                /* This needs to be rounded to some integer value. */
        1,      /* Max frame_count? */
        "???");

    if(stream < 0)
    {
        protocol_set_device_status(
                protocol,
                device,
                protocol_DeviceStatus_DEVICE_STATUS_ERROR,
                "Failed to add streams.");
        return true;
    }

    protocol_add_stream_rank(
            protocol,
            device,
            stream,
            "Chirp",
            radar_configs[preset_index].chirps_per_frame,
            NULL);

    protocol_add_stream_rank(
            protocol,
            device,
            stream,
            "Sample",
            radar_configs[preset_index].samples_per_chirp,
            NULL);

    protocol_add_stream_rank(
            protocol,
            device,
            stream,
            "Antenna",
            radar_configs[preset_index].rx_antennas,
            NULL);

    return true;
}
/******************************************************************************
* Function Name: _config_hw
********************************************************************************
* Summary:
*   Configures radar using presets.
*
* Parameters:
*   dev: Pointer to the dev_bgt60trxx_t device handle.
*   preset: One of the presets available.
*
* Return:
*   True if configuration is successful, otherwise false.
*
*******************************************************************************/
static bool _config_hw(dev_bgt60trxx_t *radar, int preset)
{

    int status;

/* Reinitialize the radar using the selected radar_settings. */
    status = xensiv_bgt60trxx_config(&radar->bgt60_obj.dev,
                                    radar_configs[preset].register_list,
                                    radar_configs[preset].number_of_regs);
    if ( status != XENSIV_BGT60TRXX_STATUS_OK )
    {
        printf("Radar config HW failed\n");
        return false;
    }

/* Update the fifo limit for the interrupts. */
    status = xensiv_bgt60trxx_set_fifo_limit(&radar->bgt60_obj.dev, radar_configs[preset].fifo_int_level);
    if ( status != XENSIV_BGT60TRXX_STATUS_OK )
    {
        printf("Radar config fifo limit failed\n");
        return false;
    }

    enable_dma_triggers( &bgt60_send_buffer );
    return true;
}

/*******************************************************************************
* Function Name: _start_streams
********************************************************************************
* Summary:
*   Called when streaming is started. This may also initialize the device.
*
* Parameters:
*   protocol: Pointer the protocol handle
*   device: The device index
*   ostream: Pointer to the output stream to write to
*   arg: Pointer the device struct (dev_bgt60trxx_t)
*
*******************************************************************************/
static void _start_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg)
{
    dev_bgt60trxx_t* radar = (dev_bgt60trxx_t*)arg;
    int preset_index;


    UNUSED(radar);
    UNUSED(ostream);

    protocol_get_option_oneof(protocol, device, DEV_BGT60TRXX_OPTION_PRESET, &preset_index);
    current_config_g = preset_index;

    if(!_config_hw(radar, preset_index) )
    {
        protocol_set_device_status(
            protocol,
            device,
            protocol_DeviceStatus_DEVICE_STATUS_ERROR,
            "Failed to configure hardware.");
    }

    /* TODO: enable radar */
    if (xensiv_bgt60trxx_soft_reset(&radar->bgt60_obj.dev, XENSIV_BGT60TRXX_RESET_FIFO) != XENSIV_BGT60TRXX_STATUS_OK)
    {
        /* Error */
        printf("Fifo reset error error.\r\n");
    }

    if (xensiv_bgt60trxx_start_frame(&radar->bgt60_obj.dev, true) != XENSIV_BGT60TRXX_STATUS_OK)
    {
        /* Error */
        printf("Start frame error.\r\n");
    }
    else
    {
       printf("\nStreaming RADAR data.\n");
    }

    protocol_set_device_status(
            protocol,
            device,
            protocol_DeviceStatus_DEVICE_STATUS_ACTIVE,
            "Device is streaming");

    radar_sent_frames = 0;

