Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
}

/*******************************************************************************
* Function Name: _stop_streams
********************************************************************************
* Summary:
*  Called when streaming is stopped.
*
* Parameters:
*  protocol: Pointer the protocol handle
*  device: The device index
*  ostream: Pointer to the output stream to write to
*  arg: Pointer the device struct (dev_bgt60trxx_t)
*
*******************************************************************************/
static void _stop_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg)
{

    dev_bgt60trxx_t* radar = (dev_bgt60trxx_t*)arg;

    UNUSED(ostream);

    printf("Stopping RADAR data Streams!\n");

    /* TODO: disable radar */
    if (xensiv_bgt60trxx_start_frame(&radar->bgt60_obj.dev, false) != XENSIV_BGT60TRXX_STATUS_OK)
    {
        /* Error */
    }

    protocol_set_device_status(
            protocol,
            device,
            protocol_DeviceStatus_DEVICE_STATUS_READY,
            "Device stopped");

    Cy_DMA_Channel_Disable(DW0, DMA_CHANNEL_SPI_RX);
    Cy_DMA_Channel_Disable(DW0, DMA_CHANNEL_SPI_TX);

    radar_sent_frames = 0;

}


/*******************************************************************************
* Function Name: _poll_streams
********************************************************************************
* Summary:
*  Called periodically to send data messages.
*
* Parameters:
*  protocol: Pointer the protocol handle
*  device: The device index
*  ostream: Pointer to the output stream to write to
*  arg: Pointer the device struct (dev_bgt60trxx_t)
*
*******************************************************************************/

enum spi_state {
    NONE = 0,
    IDLE,
    SPI_MODE_CHANGE,
    BURST_PENDING,
    FIFO_READ_PENDING,
    FIFO_READ_DONE
};

enum spi_state sp_state = IDLE;

static void _poll_streams(protocol_t* protocol, int device, pb_ostream_t* ostream, void* arg)
{

    dev_bgt60trxx_t* radar = (dev_bgt60trxx_t*)arg;

    xensiv_bgt60trxx_t* p_device = &radar->bgt60_obj.dev;

    void* iface = p_device->iface;
    xensiv_bgt60trxx_mtb_iface_t* mtb_iface = iface;

    /* If any dma channel for reading or writing is enabled we can skip the rest of
    ** this polling. The transfer status only checks if the command is sent or not.
    ** The actual raw data transport also needs to be monitored and we must ensure
    ** we are NOT DISTURBING that by trying to send a new command! Raw data transport
    ** is detected by the activity of the DMA channels.
    */

    if (0UL != (CY_SCB_SPI_TRANSFER_ACTIVE &
                Cy_SCB_SPI_GetTransferStatus(mtb_iface->scb_inst, mtb_iface->spi))){
        return;
    }

    if ( Cy_DMA_Channel_IsEnabled(DW0, DMA_CHANNEL_SPI_RX) ||
         Cy_DMA_Channel_IsEnabled(DW0, DMA_CHANNEL_SPI_TX) ){
        return;
    }

    switch (sp_state)
    {
        case IDLE:
        {
            /* This line comes from the radar IC and indicates the fifo
            ** on the radar have passed it's triggering level.
            **/
            int a;
            a = Cy_GPIO_Read(CYBSP_RADAR_INT_PORT,CYBSP_RADAR_INT_NUM);

            if (a)
            {

                /* Make Chip select */
                xensiv_bgt60trxx_platform_spi_cs_set(iface, false);

                /* Set the burstmode on the radar. */
                static uint32_t command;
                uint32_t* head = (uint32_t*)&command;
                const xensiv_bgt60trxx_mtb_iface_t* mtb_iface = iface;

                *head = XENSIV_BGT60TRXX_SPI_BURST_MODE_CMD |
                        (p_device->type->fifo_addr << XENSIV_BGT60TRXX_SPI_BURST_MODE_SADR_POS) |   /* Addr 0x60.. */
                        (0 << XENSIV_BGT60TRXX_SPI_BURST_MODE_RWB_POS) |    /* Read mode    */
                        (0 << XENSIV_BGT60TRXX_SPI_BURST_MODE_LEN_POS);     /* Read until termination. */

                /* Ensure correct byte order for sending the command. */
                *head = xensiv_bgt60trxx_platform_word_reverse(*head);

                spi_set_data_width(mtb_iface->scb_inst, 8U);
                Cy_SCB_SetByteMode(mtb_iface->scb_inst, true);

                Cy_SCB_SPI_Transfer(mtb_iface->scb_inst, (uint8_t*)head,
                                                                NULL, /* Received data is discarded. */
                                                                4,
                                                                mtb_iface->spi);
                sp_state = SPI_MODE_CHANGE;
                return;
            }
            break;
        }

        case SPI_MODE_CHANGE:
        {
            /* Each data sample from the radar is 12 bit. This appears as 16 bit
            ** in the SPI-fifo. */
            spi_set_data_width(mtb_iface->scb_inst, 12U);
            Cy_SCB_SetByteMode(mtb_iface->scb_inst, false);

            /* Prepare the reception of data by starting the RX channel */
            Cy_SCB_SetRxFifoLevel(mtb_iface->scb_inst, 31);
            Cy_DMA_Channel_Enable(DW0, DMA_CHANNEL_SPI_RX);

            /* Start a DMA transfer for writing SPI data */
            Cy_SCB_SetTxFifoLevel(mtb_iface->scb_inst, 1);
            Cy_DMA_Channel_Enable(DW0, DMA_CHANNEL_SPI_TX);

            sp_state = BURST_PENDING;
            break;
        }

        case BURST_PENDING:
        {
            /* When the DMA transfer is ready, the channels will automatically get disabled. */
            sp_state = FIFO_READ_PENDING;
        }

        case FIFO_READ_PENDING:
        {
            /* Clear the Chip Select. */
            xensiv_bgt60trxx_platform_spi_cs_set(iface, true);
            sp_state = FIFO_READ_DONE;  /* This also indicates that buffer copying below can be done.*/
            break;
        }

        case FIFO_READ_DONE:
        {
            sp_state = IDLE;
            break;
        }

        default:
        {
            break;
        }
    }

    if(sp_state == FIFO_READ_DONE)
    {

        int frames=0;
        frames = radar_configs[current_config_g].fifo_int_level / radar_configs[current_config_g].num_samples_per_frame;

/*********************************************************************************/

        if ( frames )
        {
            protocol_send_data_chunk(
                protocol,
                device,
                0,
                frames,
                radar->skipped_frames,
                ostream,
                _write_payload);

