Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
        }
        radar_sent_frames+=frames;
        radar->skipped_frames = 0;

        static int sent_counter=0;
        if (sent_counter == 10)
        {
            sent_counter=0;
        }
        else{
            sent_counter++;
        }


    }
}

/*******************************************************************************
* Function Name: _write_payload
********************************************************************************
* Summary:
*  Used by protocol_send_data_chunk to write the actual data.
*
* Parameters:
*  protocol: Pointer the protocol handle
*  device_id: The device index
*  stream_id: The stream index
*  frame_count: Number of frames to write
*  total_bytes: Total number of bytes to write (= frame_count * sizeof(type) * frame_shape.flat)
*  ostream: Pointer to the output stream to write to
*  arg: Pointer the device struct (dev_bgt60trxx_t)
*
* Return:
*   True if data writing is successful, otherwise false.
*
*******************************************************************************/
static bool _write_payload(
    protocol_t* protocol,
    int device_id,
    int stream_id,
    int frame_count,
    int total_bytes,
    pb_ostream_t* ostream,
    void* arg)
{
    UNUSED(protocol);
    UNUSED(stream_id);
    UNUSED(frame_count);
    UNUSED(protocol);

   /*Invalidating data in DCache*/
    SCB_InvalidateDCache_by_Addr((uint32_t*)&bgt60_send_buffer, total_bytes);

    if (!pb_write(ostream, (const pb_byte_t *)bgt60_send_buffer, total_bytes))
    {
        return false;
    }

    return true;
}

/*******************************************************************************
* Summary:
*   This gets a binary data_blob via the protocol and transfer this values to
*   setting index 4. This 'slot' is initially identical to the first but is
*   overwritten by custom data if set.
*******************************************************************************/
static void _load_custom_values( uint8_t* data_blob )
{

    /* Binary file is prepended with a 2 byte size that should be skipped. */
    uint32_t* values = (uint32_t*)(data_blob+2);

/* Ensure this is updated if the binary file is generated diffrently. */
#define OFF_REGS_START                      16
#define OFF_CONF_NUM_REGS                   0
#define OFF_CONF_REGS_START                 1
#define OFF_CONF_START_FREQ_LO_HZ           2
#define OFF_CONF_START_FREQ_HI_HZ           3
#define OFF_CONF_END_FREQ_LO_HZ             4
#define OFF_CONF_END_FREQ_HI_HZ             5
#define OFF_CONF_NUM_SAMPLES_PER_CHIRP      6
#define OFF_CONF_NUM_CHIRPS_PER_FRAME       7
#define OFF_CONF_NUM_RX_ANTENNAS            8
#define OFF_CONF_NUM_TX_ANTENNAS            9
#define OFF_CONF_SAMPLE_RATE                10
#define OFF_CONF_CHIRP_REPETITION_TIME_S    11
#define OFF_CONF_FRAME_REPETITION_TIME_S    12

    /* Misaligned 64 bit data needs bytewise copying.  */
    memcpy( (char*)&radar_configs[4].start_freq, (char*)&values[OFF_CONF_START_FREQ_LO_HZ], 8 );
    memcpy( (char*)&radar_configs[4].end_freq, (char*)&values[OFF_CONF_END_FREQ_LO_HZ], 8 );

    radar_configs[4].samples_per_chirp =     values[OFF_CONF_NUM_SAMPLES_PER_CHIRP];
    radar_configs[4].chirps_per_frame =      values[OFF_CONF_NUM_CHIRPS_PER_FRAME];
    radar_configs[4].rx_antennas =           values[OFF_CONF_NUM_RX_ANTENNAS];
    radar_configs[4].tx_antennas =           values[OFF_CONF_NUM_TX_ANTENNAS];
    radar_configs[4].sample_rate =           values[OFF_CONF_SAMPLE_RATE];

    radar_configs[4].chirp_repetition_time = *(float*)&values[OFF_CONF_CHIRP_REPETITION_TIME_S];  /* 32bit float */
    radar_configs[4].frame_repetition_time = *(float*)&values[OFF_CONF_FRAME_REPETITION_TIME_S];  /* 32bit float */

    radar_configs[4].frame_rate = (int)(0.5 + 1.0/(double)radar_configs[4].frame_repetition_time);

    radar_configs[4].num_samples_per_frame =
            radar_configs[4].samples_per_chirp *
            radar_configs[4].chirps_per_frame *
            radar_configs[4].rx_antennas;

    radar_configs[4].fifo_int_level = DEFAULT_FIFO_SETTING; /* Since the set_fifo_limit function takes samples this is only half. */
    radar_configs[4].number_of_regs =           values[OFF_CONF_NUM_REGS];
    radar_configs[4].register_list = &values[values[OFF_CONF_REGS_START]];

    return;

}
/*******************************************************************************
* Summary:
*   This just load preset from header file constants to enable selection of
*   various radar presets.
* See dev_bgt60trxx_settings.h for information of the sources of radar settings.
*
*******************************************************************************/
static void _load_presets()
{
/* Config 1 Default testing configuration. */
    radar_configs[0].start_freq =            P0_XENSIV_BGT60TRXX_CONF_START_FREQ_HZ;
    radar_configs[0].end_freq =              P0_XENSIV_BGT60TRXX_CONF_END_FREQ_HZ;
    radar_configs[0].samples_per_chirp =     P0_XENSIV_BGT60TRXX_CONF_NUM_SAMPLES_PER_CHIRP;
    radar_configs[0].chirps_per_frame =      P0_XENSIV_BGT60TRXX_CONF_NUM_CHIRPS_PER_FRAME;
    radar_configs[0].rx_antennas =           P0_XENSIV_BGT60TRXX_CONF_NUM_RX_ANTENNAS;
    radar_configs[0].tx_antennas =           P0_XENSIV_BGT60TRXX_CONF_NUM_TX_ANTENNAS;
    radar_configs[0].sample_rate =           P0_XENSIV_BGT60TRXX_CONF_SAMPLE_RATE;
    radar_configs[0].chirp_repetition_time = P0_XENSIV_BGT60TRXX_CONF_CHIRP_REPETITION_TIME_S;
    radar_configs[0].frame_repetition_time = P0_XENSIV_BGT60TRXX_CONF_FRAME_REPETITION_TIME_S;

    radar_configs[0].frame_rate = (int)(0.5 + 1.0/(double)radar_configs[0].frame_repetition_time);
    radar_configs[0].num_samples_per_frame =
            radar_configs[0].samples_per_chirp *
            radar_configs[0].chirps_per_frame *
            radar_configs[0].rx_antennas;

    radar_configs[0].fifo_int_level = DEFAULT_FIFO_SETTING;


    radar_configs[0].number_of_regs =           P0_XENSIV_BGT60TRXX_CONF_NUM_REGS;
    radar_configs[0].register_list = register_list_p0;

/* Config 2 Gesture detection */
    radar_configs[1].start_freq =            P1_XENSIV_BGT60TRXX_CONF_START_FREQ_HZ;
    radar_configs[1].end_freq =              P1_XENSIV_BGT60TRXX_CONF_END_FREQ_HZ;
    radar_configs[1].samples_per_chirp =     P1_XENSIV_BGT60TRXX_CONF_NUM_SAMPLES_PER_CHIRP;
    radar_configs[1].chirps_per_frame =      P1_XENSIV_BGT60TRXX_CONF_NUM_CHIRPS_PER_FRAME;
    radar_configs[1].rx_antennas =           P1_XENSIV_BGT60TRXX_CONF_NUM_RX_ANTENNAS;
    radar_configs[1].tx_antennas =           P1_XENSIV_BGT60TRXX_CONF_NUM_TX_ANTENNAS;
    radar_configs[1].sample_rate =           P1_XENSIV_BGT60TRXX_CONF_SAMPLE_RATE;
    radar_configs[1].chirp_repetition_time = P1_XENSIV_BGT60TRXX_CONF_CHIRP_REPETITION_TIME_S;
    radar_configs[1].frame_repetition_time = P1_XENSIV_BGT60TRXX_CONF_FRAME_REPETITION_TIME_S;

    radar_configs[1].frame_rate = (int)(0.5 + 1.0/(double)radar_configs[1].frame_repetition_time);
    radar_configs[1].num_samples_per_frame =
            radar_configs[1].samples_per_chirp *
            radar_configs[1].chirps_per_frame *
            radar_configs[1].rx_antennas;

    radar_configs[1].fifo_int_level = DEFAULT_FIFO_SETTING;


    radar_configs[1].number_of_regs =           P1_XENSIV_BGT60TRXX_CONF_NUM_REGS;
    radar_configs[1].register_list = register_list_p1;

