Infineon/mtb-example-psoc-edge-ml-deepcraft-data-collection/proj_cm55/devices/dev_bgt60trxx.c
/* Config 3 Macro movements */
    radar_configs[2].start_freq =            P2_XENSIV_BGT60TRXX_CONF_START_FREQ_HZ;
    radar_configs[2].end_freq =              P2_XENSIV_BGT60TRXX_CONF_END_FREQ_HZ;
    radar_configs[2].samples_per_chirp =     P2_XENSIV_BGT60TRXX_CONF_NUM_SAMPLES_PER_CHIRP;
    radar_configs[2].chirps_per_frame =      P2_XENSIV_BGT60TRXX_CONF_NUM_CHIRPS_PER_FRAME;
    radar_configs[2].rx_antennas =           P2_XENSIV_BGT60TRXX_CONF_NUM_RX_ANTENNAS;
    radar_configs[2].tx_antennas =           P2_XENSIV_BGT60TRXX_CONF_NUM_TX_ANTENNAS;
    radar_configs[2].sample_rate =           P2_XENSIV_BGT60TRXX_CONF_SAMPLE_RATE;
    radar_configs[2].chirp_repetition_time = P2_XENSIV_BGT60TRXX_CONF_CHIRP_REPETITION_TIME_S;
    radar_configs[2].frame_repetition_time = P2_XENSIV_BGT60TRXX_CONF_FRAME_REPETITION_TIME_S;

    radar_configs[2].frame_rate = (int)(0.5 + 1.0/(double)radar_configs[2].frame_repetition_time);
    radar_configs[2].num_samples_per_frame =
            radar_configs[2].samples_per_chirp *
            radar_configs[2].chirps_per_frame *
            radar_configs[2].rx_antennas;

    radar_configs[2].fifo_int_level = DEFAULT_FIFO_SETTING;


    radar_configs[2].number_of_regs =           P2_XENSIV_BGT60TRXX_CONF_NUM_REGS;
    radar_configs[2].register_list = register_list_p2;

/* Config 4 Micro movements. */
    radar_configs[3].start_freq =            P3_XENSIV_BGT60TRXX_CONF_START_FREQ_HZ;
    radar_configs[3].end_freq =              P3_XENSIV_BGT60TRXX_CONF_END_FREQ_HZ;
    radar_configs[3].samples_per_chirp =     P3_XENSIV_BGT60TRXX_CONF_NUM_SAMPLES_PER_CHIRP;
    radar_configs[3].chirps_per_frame =      P3_XENSIV_BGT60TRXX_CONF_NUM_CHIRPS_PER_FRAME;
    radar_configs[3].rx_antennas =           P3_XENSIV_BGT60TRXX_CONF_NUM_RX_ANTENNAS;
    radar_configs[3].tx_antennas =           P3_XENSIV_BGT60TRXX_CONF_NUM_TX_ANTENNAS;
    radar_configs[3].sample_rate =           P3_XENSIV_BGT60TRXX_CONF_SAMPLE_RATE;
    radar_configs[3].chirp_repetition_time = P3_XENSIV_BGT60TRXX_CONF_CHIRP_REPETITION_TIME_S;
    radar_configs[3].frame_repetition_time = P3_XENSIV_BGT60TRXX_CONF_FRAME_REPETITION_TIME_S;

    radar_configs[3].frame_rate = (int)(0.5 + 1.0/(double)radar_configs[3].frame_repetition_time);
    radar_configs[3].num_samples_per_frame =
            radar_configs[3].samples_per_chirp *
            radar_configs[3].chirps_per_frame *
            radar_configs[3].rx_antennas;

    radar_configs[3].fifo_int_level = DEFAULT_FIFO_SETTING;

    radar_configs[3].number_of_regs =           P3_XENSIV_BGT60TRXX_CONF_NUM_REGS;
    radar_configs[3].register_list = register_list_p3;

/* The fifth configuration is the configuration used for customization and is loaded
 * with the same as the first as default. This will then be overwritten if a new
 * blob arrives. */

    memcpy( &radar_configs[4], &radar_configs[0], sizeof(radar_configs[0]) );

    return;
}

/*******************************************************************************
* Function Name: dev_bgt60trxx_register
********************************************************************************
* Summary:
*   Registers this device. This is the only exported symbol from this object.
*
* Parameters:
*   protocol: Pointer the protocol handle
*
* Returns:
*   True if registration is successful, otherwise false.
*
*******************************************************************************/
bool dev_bgt60trxx_register(protocol_t* protocol)
{
    int status;
    dev_bgt60trxx_t *radar = (dev_bgt60trxx_t*)malloc(sizeof(dev_bgt60trxx_t));

    if(radar == NULL)
    {
        printf("BGT60TRXX::malloc failed.\r\n");
        return false;
    }
    memset(radar, 0, sizeof(dev_bgt60trxx_t));

    _load_presets();

    if( !_init_hw(radar) )
    {
        printf("BGT60TRXX::hw_init failed.\r\n");
        return false;
    }

    device_manager_t manager = {
        .arg = radar,
        .configure_streams = _configure_streams,
        .start = _start_streams,
        .stop = _stop_streams,
        .poll = _poll_streams,
        .data_received = NULL /* has no input streams */
    };

    int device = protocol_add_device(
        protocol,
        protocol_DeviceType_DEVICE_TYPE_SENSOR,
        "Radar",
        "Radar device (bgt60trxx)",
        manager);

    if(device < 0)
    {
        printf("BGT60TRXX::adding device failed.\r\n");
        return false;
    }

    status = protocol_add_option_oneof(
        protocol,
        device,
        DEV_BGT60TRXX_OPTION_PRESET,
        "Use case",
        "Presets",
        0,
        (const char* []) { "Default", "Gesture", "Macro Presence", "Micro Presence", "Custom" },
        5);

    if(PROTOCOL_STATUS_SUCCESS != status)
    {
        printf("Adding option failed\n");
        return false;
    }

    status = protocol_add_option_blob(
        protocol,
        device,
        DEV_BGT60TRXX_OPTION_CUSTOM_SET,
        "Custom data",
        "Binary Custom data",
        NULL /*pb_bytes_array_t* default_value  */
        );

    if(PROTOCOL_STATUS_SUCCESS != status)
    {
        printf("Adding option custom set failed\n");
        return false;
    }

    if(!_configure_streams(protocol, device, manager.arg))
    {
        printf("BGT60TRXX::configure streams failed.\r\n");
        return false;
    }

    return true;
}

#endif /* IM_ENABLE_BGT60TRXX */
